# GetReferenceInformation Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceReference..::..GetReferenceInformation Method
ExternalResourceReference Class See Also
---
Returns a copy of an object containing previously-stored reference or lookup information about the specific resource provided by the server.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IDictionary<string, string> GetReferenceInformation()
```

Visual Basic
---
```text
Public Function GetReferenceInformation As IDictionary(Of String, String)
```

Visual C++
---
```text
public:
IDictionary<String^, String^>^ GetReferenceInformation()
```

# ### Return Value
A copy of a (String, String) map containing previously-stored reference or lookup information.
# See Also
ExternalResourceReference Class
Autodesk.Revit.DB Namespace